#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e0776b81-e6a5-4946-9274-60a1f7a37b38]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e993ca3d-8593-4857-9479-465e2ec020ed]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=faf23fbd-e2c7-4bcf-84e2-1be6a29ebd8c]
module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cc93e477-26b6-4b09-8728-75785a46c0ab]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7f4ae80c-53c3-4347-b191-6d1ffba9c519]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7772118c-8444-44c9-9c7f-511037d800f6]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9e8702cd-694c-4ab5-92ef-b04cd834c03d]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=47a3a60a-945c-4c00-b37b-359f2d5405bb]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5be50a8-a0a3-4f47-9e47-95db04b2d6bf]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4be42312-e75b-4ca0-a41d-f701354c1089]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8d2b9efe-af54-45f8-9ec9-281a2128bf5e]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=d8d7a623-3f35-4e83-b65f-0a7e6b0264c6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0cd7fc4a-e210-43bd-a610-ee655f762b5d]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ced9fffc-1128-422e-83f3-f4d4e9895f1d]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8385af59-4718-41d9-9091-3882dd90bac5]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ddf41877-1ec3-4f3a-9dc8-6c3bb355f53b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4969436c-370e-40e5-95e6-274a87fe85a6]
module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=256d9190-2c31-4ded-be0f-636e92a4fc13]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=31513666-47dd-4882-bf62-833188217a03]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=478093b5-1d85-44ee-9290-1dde831f4bb2]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=af79bb43-7e01-4a26-9813-bd8eccce45ec]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=919a2516-5484-44bf-ba5d-298b70c76a83]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=771cf276-c9b5-42d8-ad89-11674cbabf0e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=cb43e349-c7a3-4787-a9ed-4a493edd0a10]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c29c273e-4919-4ee1-a9c7-e94028642638]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c12bf377-f60c-4b79-b1ef-5828f1ab66f9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1766753c-5bec-4425-b67b-99096816e02e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ad14a42-adf0-4eb6-b87f-04478a1b85ba]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e38de05-06d5-436a-9de0-b320970d2c38]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "3eab4400-f036-402f-9520-9519d402bdc1"
        name                                     = "kuro-mar-07-b-ce-id-business-test-6371"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://devchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidDev.com",
        ]
        # (12 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-both-test-6372"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_kuro-mar-07-b-ce-id-both-test-6372.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-both-test-6372"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-both-test-6372"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "2a8d39a5-91ad-4700-99ce-32905ea0de8b"
        name                                     = "kuro-mar-07-b-ce-id-business-test-6371"
      - pkce_code_challenge_method               = "S256" -> null
      ~ valid_redirect_uris                      = [
          + "http://testchange.com",
            # (1 unchanged element hidden)
        ]
      ~ web_origins                              = [
          - "+",
          - "http://bceidTest.com",
        ]
        # (11 unchanged attributes hidden)
    }

Plan: 20 to add, 2 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4270 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*